//---------------------------------------------------------------------------

#include "ClanWar.h"

//---------------------------------------------------------------------------



//---------------------------------------------------------------------------
// CClanMember
//---------------------------------------------------------------------------

CClanMember::CClanMember()
{
	DataClear();
}

//---------------------------------------------------------------------------

CClanMember::~CClanMember()
{
	DataClear();
}

//---------------------------------------------------------------------------



//---------------------------------------------------------------------------
// 방 청소! : 기존의 데이타 값을 초기화 한다.
//---------------------------------------------------------------------------

BOOL CClanMember::DataClear()
{
	// 클랜 정보로 사용중인가? 아니라면 다른 클랜이 추가될때 여기에 덮어쓴다.
	// 클랜원이 한 사람이라도 접속해 있으면 TRUE
	m_bIsUse = FALSE;

	// 클랜전에 참여한 멤버 표시
	m_bIsWar = FALSE;

	// 유저 정보 (포인터만 보관)
	m_pMember = NULL;

	// 클랜전 시작할때 자신이 있던 맵 번호 (클랜전 종류후 복귀할 맵으로 사용)
	m_dwReturnZoneNo = 0;

	return TRUE;
}

//---------------------------------------------------------------------------



//---------------------------------------------------------------------------
// 사용중인 멤버 데이타인가? (비사용중:DataClear후 다시 사용)
//---------------------------------------------------------------------------

BOOL CClanMember::SetUseFlag( BOOL bUseFlag )
{
	m_bIsUse = bUseFlag;

	return TRUE;
}

//---------------------------------------------------------------------------

BOOL CClanMember::IsUse()
{
	return m_bIsUse;
}

//---------------------------------------------------------------------------



//---------------------------------------------------------------------------
// 클랜전에 참여한 클랜원인가?
//---------------------------------------------------------------------------

BOOL CClanMember::SetUseWarFlag( BOOL bUseWarFlag )
{
	m_bIsWar = bUseWarFlag;

	return TRUE;
}

//---------------------------------------------------------------------------

BOOL CClanMember::IsWarZone( DWORD dwClanWarZoneNo )
{
	CZoneTHREAD* pZoneThread = NULL;


	if( m_pMember && m_pMember->m_nZoneNO == (short)dwClanWarZoneNo )
		return TRUE;
/*
	if( (pZoneThread = m_pMember->GetZONE()) != NULL )
	{
		if( pZoneThread->Get_ZoneNO() == (short)dwClanWarZoneNo )
		{
			return TRUE;
		}
	}
*/
	return FALSE; //m_bIsWar;
}

//---------------------------------------------------------------------------



//---------------------------------------------------------------------------
// 클랜원 세팅
//---------------------------------------------------------------------------

BOOL CClanMember::SetMember( classUSER* pMember )
{
	m_pMember = pMember;

	return TRUE;
}

//---------------------------------------------------------------------------

BOOL CClanMember::IsMaster()
{
	return m_pMember->Is_ClanMASTER();
}

//---------------------------------------------------------------------------

classUSER* CClanMember::GetMember()
{
	return m_pMember;
}

//---------------------------------------------------------------------------



//---------------------------------------------------------------------------
// 클랜전 복귀 존 번호 (자신이 있던곳)
//---------------------------------------------------------------------------

BOOL CClanMember::SetReturnZoneNo( DWORD dwReturnZoneNo )
{
	m_dwReturnZoneNo = dwReturnZoneNo;

	return TRUE;
}

//---------------------------------------------------------------------------

DWORD CClanMember::GetReturnZoneNo()
{
	return m_dwReturnZoneNo;
}

//---------------------------------------------------------------------------



//---------------------------------------------------------------------------
// 클랜 변수
//---------------------------------------------------------------------------

BOOL CClanMember::SetClanWarValue( DWORD dwIDX, WORD wValue )
{
	// 인덱스 범위 채크
	if( dwIDX >= QUEST_CLANWAR_VAR_CNT )
		return FALSE;

	m_pMember->m_Quests.m_nClanWarVAR[dwIDX] = wValue;

	return TRUE;
}

//---------------------------------------------------------------------------

WORD CClanMember::GetClanWarValue( DWORD dwIDX )
{
	if( m_pMember )
		return (WORD)m_pMember->m_Quests.m_nClanWarVAR[dwIDX];

	return 0;
}

//---------------------------------------------------------------------------



//---------------------------------------------------------------------------
// 클랜내 직위(등급)
//---------------------------------------------------------------------------

DWORD CClanMember::GetGrade()
{
	if( m_pMember )
		return (DWORD)m_pMember->m_CLAN.m_btClanPOS;

	return 0;
}

//---------------------------------------------------------------------------
// 이름
//---------------------------------------------------------------------------

char* CClanMember::GetName()
{
	if( m_pMember )
		return m_pMember->Get_NAME();

	return "";
}

//---------------------------------------------------------------------------
// 계정 이름
//---------------------------------------------------------------------------

char* CClanMember::GetAccountName()
{
	if( m_pMember )
		return m_pMember->Get_ACCOUNT();

	return "";
}

//---------------------------------------------------------------------------
// 클랜전 진입 타임아웃 (클라이언트에 떠있는 클랜전 참가관련 메시지창을 닫게한다.)
//---------------------------------------------------------------------------

BOOL CClanMember::StartTimeOut()
{
	if( m_pMember )
	{
		m_pMember->Send_gsv_CLANWAR_Err( CWAR_START_TIME_OUT );
		return TRUE;
	}

	return FALSE;
}

//---------------------------------------------------------------------------
// 클랜전 포기한 메시지 전달
//---------------------------------------------------------------------------

BOOL CClanMember::ClanWarRejoinGiveUp( DWORD dwEnumErrMsg )
{
	if( m_pMember )
	{
		m_pMember->Send_gsv_CLANWAR_Err( (WORD)dwEnumErrMsg );
	}

	return TRUE;
}

//---------------------------------------------------------------------------
// 보상 포인트 가져오기
//---------------------------------------------------------------------------

DWORD CClanMember::GetRewardPoint()
{
	if( m_pMember )
	{
		return m_pMember->m_CLAN.m_iRewardPoint;
	}

	return -1;
}

//---------------------------------------------------------------------------

