/*---------------------------------------------------------------------------
Make:		2006.02.15
Name:		ZTrace.h
Author:     남병철.레조

Desc:		디버그창에 디버그 메시지 생성
---------------------------------------------------------------------------*/



//---------------------------------------------------------------------------

#ifndef __ZTRACE_H__
#define __ZTRACE_H__

//---------------------------------------------------------------------------

#include <stdio.h>
//#include <stdarg.h>
//#include <stdlib.h>
//#include <string.h>

//---------------------------------------------------------------------------

//#define _ZTRACE_DEBUG

//---------------------------------------------------------------------------

#ifdef _CONSOLE // 콘솔 프로그램인경우는 OutputDebugString 함수를 사용하기 위해 Windows.h를 인클루드 함
	#include <windows.h>
#else 
	#ifdef _ZTRACE_DEBUG
		#define TRACE debug_printf
		#define ZTRACE  TRACE( "\n%s(%d)\n=> ", __FILE__, __LINE__ ); TRACE
	#else 
		#define TRACE /##/
		#define ZTRACE  TRACE
	#endif
#endif// _CONSOLE 

//---------------------------------------------------------------------------



//---------------------------------------------------------------------------

int debug_printf( char *format, ... );

//---------------------------------------------------------------------------

#endif //__TRACEX_H__
